export const API_BASE_URL = 'http://localhost:3000'

//таймзоны
export const TIMEZONES = [
  { key: '-1', value: 'Калининград (МСК-1)' },
  { key: '0', value: 'Москва (МСК)' },
  { key: '1', value: 'Самара (МСК+1)' },
  { key: '2', value: 'Екатеринбург (МСК+2)' },
  { key: '3', value: 'Омск (МСК+3)' },
  { key: '4', value: 'Красноярск (МСК+4)' },
  { key: '5', value: 'Иркутск (МСК+5)' },
  { key: '6', value: 'Якутск (МСК+6)' },
  { key: '7', value: 'Владивосток (МСК+7)' },
  { key: '8', value: 'Магадан (МСК+8)' },
  { key: '9', value: 'Камчатка (МСК+9)' },
]

//часы
export const HOURS = [
  '01:00',
  '02:00',
  '03:00',
  '04:00',
  '05:00',
  '06:00',
  '07:00',
  '08:00',
  '09:00',
  '10:00',
  '11:00',
  '12:00',
  '13:00',
  '14:00',
  '15:00',
  '16:00',
  '17:00',
  '18:00',
  '19:00',
  '20:00',
  '21:00',
  '22:00',
  '23:00',
  '00:00',
]

//дни
export const DAYS = [
  'Понедельник',
  'Вторник',
  'Среда',
  'Четверг',
  'Пятница',
  'Суббота',
  'Воскресенье',
]

//дни короткие названия
export const DAYS_NUM_NAMES = ['ПН-ВС', 'ПН', 'ВТ', 'СР', 'ЧТ', 'ПТ', 'СБ', 'ВС']
